#ifndef _MATCH_H
#define _MATCH_H

/********************************/
/*  процедура инициализации     */
/*  присваивает переменным      */
/*  ch, nexch                   */
/********************************/
void match_init(char* line);

/********************************/
/*  процедура деинициализации	*/
/********************************/
void match_done(void);

/****************************************/
/*  Сравнение константы с содержимым    */
/*  буфера строк. Продвижение указателя */
/*  буфера, если было совпадение        */
/****************************************/
int match(char *lit);

/********************************/
/*      'match'  , но           */
/*    по 'len'  символам        */
/********************************/
int amatch(char *lit,int len);

/********************************/
/*   чтение метки               */
/********************************/
int symname(char *sname);

/********************************/
/* проверка на число            */
/********************************/
int number(int val[]);

/********************************/
/*  пропуск пустых символов	    */
/********************************/
void skipblanks(void);

/********************************/
/*  пропуск лексемы и следующ	*/
/*       пустых символов        */
/********************************/
void skipchars(void);



#endif
